УТ_для_edt.РасширениеСмарт/src/Catalogs/Заметки/Заметки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Заметки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекстСодержания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Пометка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДляРабочегоСтола</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаЗаметки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПредставлениеПредмета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9cca9751-c599-4906-ad10-d4c17fd84503">
    <name>смартКвалификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Enums/ЦветаЗаметок/ЦветаЗаметок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦветаЗаметок</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Зеленый</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Голубой</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Синий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Оранжевый</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Фиолетовый</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Красный</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Желтый</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Заметки/Forms/CRM_ФормаЭлемента/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

//Смарт {[+](фрагмент ДОБАВЛЕН), Подкин Алексей Иванович 06.09.2021 14:21:22
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() И (ТипЗнч(Объект.Предмет)= Тип("СправочникСсылка.Партнеры") 
		ИЛИ ТипЗнч(Объект.Предмет)= Тип("СправочникСсылка.КонтактныеЛицаПартнеров")
		ИЛИ ТипЗнч(Объект.Предмет)= Тип("ДокументСсылка.CRM_Интерес")) Тогда
		Объект.ДляРабочегоСтола = Истина;
		Объект.CRM_ЗаметкаЛенты=Истина;
		Объект.Пометка=Перечисления.ЦветаЗаметок.Желтый;
	КонецЕсли;
	
	//++ #1835 смарт: Фролов 28.05.2024 //Доработка рабочего места секретаря
	Если Объект.Ссылка.Пустая() И Параметры.Свойство("смартИсточник") Тогда
		Объект.смартИсточник = Параметры.смартИсточник;	
	КонецЕсли;
	//-- #1835 смарт: Фролов 28.05.2024
	
	//++ #1830 смарт: Фролов 24.05.2024 //Приведение механизма Заметок в Интересе и Партнере к общему виду.
	ЭтаФорма.Заголовок = "Заметка";
	//-- #1830 смарт: Фролов 24.05.2024
	
КонецПроцедуры

#КонецОбласти
